In [2]:
import pymysql

In [11]:
# 연결
conn = pymysql.connect(
    host="127.0.0.1",
    port=3305,
    password="1234",
    user="root",
    db="modudb",
    charset="utf8",
)

In [13]:
# 커서
cur = conn.cursor()

In [6]:
create_table_sql = """
CREATE TABLE IF NOT EXISTS tbl_users (
    idx INT AUTO_INCREMENT PRIMARY KEY,
    user_name VARCHAR(50) NOT NULL,
    phone VARCHAR(20) NOT NULL
)
"""
cur.execute(create_table_sql)
conn.commit()  # 반영

In [8]:
insert_data_sql = """
INSERT INTO tbl_users (user_name, phone) VALUES 
('아이유', '1111'),
('홍길도', '2222')
"""

cur.execute(insert_data_sql)
conn.commit()

In [14]:
# 데이터 조회
sql = "select * from tbl_users"
cur.execute(sql)

2

In [9]:
rows = cur.fetchall()  # 결과물 조회 

# 결과 출력
for row in rows:
    print(row)

(1, '아이유', '1111')
(2, '홍길도', '2222')

In [16]:
col_names = cur.description

In [17]:
col_name = []
for col in col_names:
    col_name.append(col)
col_name

[('idx', 3, None, 11, 11, 0, False),
 ('user_name', 253, None, 50, 50, 0, False),
 ('phone', 253, None, 20, 20, 0, False)]

In [15]:
import pandas as pd

In [18]:
df = pd.DataFrame(cur)

In [19]:
df

   0    1     2
0  1  아이유  1111
1  2  홍길도  2222

In [10]:
conn.close()